using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp
{
    class Program
    {
        /*
         * ДопЗадание: N-буквенные слова
         * 
         * Разработать программу, которая вводит натуральные числа M и N (M<=33),  и выводит все N-буквенные слова, состоящие из 
         * первых M букв русского алфавита. Например, при N =3 и М=4 программа должна вывести 64 слова: ААА, ААБ, ААВ, ..., ГГВ, ГГГ 
         * (порядок слов может быть и иным). Задачу решить двумя способами:
         * 
         * 1) С применением рекурсии
         * 
         * 2) Без применения рекурсии
         * 
         * Рекомендуется использовать константу-строку из букв русского алфавита.
         */

        static void Main(string[] args)
        {
            
        }
    }
}
