using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp
{
    class Program
    {
            /*
             * Разработайте функцию, которая определяет сумму элементов на диагоналях 
             * (четыре штуки, проходящие через центр куба) в трехмерном массиве. 
             * Массив должен быть кубом и функция должна это проверять.
             * 
             * В качестве ответа на вопрос введите сумму для следующего массива:
             */
        static void Main(string[] args)
        {
            
            int[,,] arrZ = {{ { 5,  86, 2 },  { 4,  8, 44 }, { 10, 7,  15 } },
                            { { 33, 21, 53 }, { 10, 1, 97 }, { 49, 53, 42 } },
                            { { 73, 3,  90 }, { 7,  8, 7 },  { 37, 81, 8 } }};

            int[,,] arrX = {{ { 23, 30, 2, 11},   { 4, 8, 12, 5 },    { 9, 11, 16, 7 },  {44, 46, 2, 8} },
                            { { 3, 21, 5, 14 },   { 14, 18, 9, 78 },  { 49, 33, 2, 2 },  {11, 61, 71, 42} },
                            { { 74, 24, 15, 64 }, { 77, 20, 59, 13 }, { 13, 3, 62, 78 }, {90, 4, 28, 62} },
                            { { 32, 32, 55, 5 },  { 71, 86, 74, 71 }, { 7, 1, 8, 99 },   {3, 1, 8, 5} }};

        }
        static int SumCube(int[,,] cube)
        {
            for (int i = 0; i < cube.GetLength(0); i++)
            {
                for (int j = 0; j < cube.GetLength(1); j++)
                {
                    for (int n = 0; n < cube.GetLength(2); n++)
                    {

                    }
                }
            }
            return
        }
    }
}
