using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading;
using System.Threading.Tasks;
using System.Runtime;
using System.Runtime.InteropServices;

namespace ConsoleApp
{
    class Program
    {
        /* Задание: Работа со строками
         * 
         * Как известно, существует несколько подходов в обработке строк. Это задание нужно сделать используя функции класса string.
         * необходимо предварительно изучить материал доступный по ссылкам в этом блоке.
         * 
         * Вариант 1.
         * Написать функцию, проверяющую (возвращает логическое значение), можно ли составить Строку1, используя только символы Строки2.
         * С учетом количества повторений каждого символа Строки2.
         * 
         * Вариант 2.
         * Написать функцию, которая составляет частотный словарь слов в заданной строке. Частотный словарь – это массив или коллекция,
         * в которой указаны все найденные в строке слова с количеством их появления.
         * 
         * Словом считать последовательность символов, разделенных пробелами.*/

        static void Main(string[] args)
        {
            
        }
    }
}
